Autodesk.Revit.DB.Structure.AreaReinforcement.SetSolidInView(Autodesk.Revit.DB.View3D,System.Boolean)
Sets this Area Reinforcement to be shown solidly in a 3D view.
view:
The 3D view element
solid:
True if Area Reinforcement is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.AreaReinforcement.IsSolidInView(Autodesk.Revit.DB.View3D)
Checks if this Area Reinforcement is shown solidly in a 3D view.
view:
The 3D view element
Returns:
True if Area Reinforcement is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.AreaReinforcement.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets Area Reinforcement to be shown unobscured in a view.
view:
The view element
unobscured:
True if Area Reinforcement is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.AreaReinforcement.SetLayerActive(System.Boolean,Autodesk.Revit.DB.Structure.AreaReinforcementLayerType)
Sets if the desired layer is active or not.
active:
True to set the layer to be active, false otherwise.
layer:
The layer type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2022

Autodesk.Revit.DB.Structure.AreaReinforcement.ResetMovedLineTransform(Autodesk.Revit.DB.Structure.AreaReinforcementLayerType,System.Int32)
Reset the transformation representing the movement of the line relative to its default position along the direction of the specified layer. The moved line transform will be set to Identity.
layer:
The layer on which the line stays.
linePositionIndex:
The index of the line from the desired layer. It should be an index between 0 and (NumberOfLines-1).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
linePositionIndex is not in the range [ 0, NumberOfLines-1 ].
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The layer layer isn't active.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AreaReinforcement does not host Rebar.
Since:
2022

Autodesk.Revit.DB.Structure.AreaReinforcement.MoveLine(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.AreaReinforcementLayerType,System.Int32)
This method applies the translation to the line from the desired layer, at the specified position.
If the line was already moved, the method will concatenate the translation with the existing movement.
The line will be translated only along the direction of the specified layer.
translation:
The translation vector.
layer:
The layer on which the line stays.
linePositionIndex:
The index of the line from the desired layer. It should be an index between 0 and (NumberOfLines-1).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
linePositionIndex is not in the range [ 0, NumberOfLines-1 ].
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The layer layer isn't active.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AreaReinforcement does not host Rebar.
Since:
2022

Autodesk.Revit.DB.Structure.AreaReinforcement.SetLineIncluded(System.Boolean,Autodesk.Revit.DB.Structure.AreaReinforcementLayerType,System.Int32)
Sets if the line from desired layer at the specified position is included or not.
include:
True to include the line, false to exclude the line.
layer:
The layer on which the line stays.
linePositionIndex:
The index of the line from the desired layer. It should be an index between 0 and (NumberOfLines-1).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
linePositionIndex is not in the range [ 0, NumberOfLines-1 ].
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The layer layer isn't active.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AreaReinforcement does not host Rebar.
Since:
2022

Autodesk.Revit.DB.Structure.AreaReinforcement.ConvertRebarInSystemToRebars(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AreaReinforcement)
Converts all RebarInSystem elements owned by the input AreaReinforcement to equivalent Rebar elements.
doc:
The document.
system:
An AreaReinforcement element in the document.
Returns:
The ids of the newly created Rebar elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element system was not found in the given document.
-or-
system does not host Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2022

Autodesk.Revit.DB.Structure.AreaReinforcement.RemoveAreaReinforcementSystem(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AreaReinforcement)
Deletes the specified AreaReinforcement, and converts its RebarInSystem
elements to equivalent Rebar elements.
doc:
The document.
system:
An AreaReinforcement element in the document.
Returns:
The ids of the newly created Rebar elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element system was not found in the given document.
-or-
system does not host Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.AreaReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new AreaReinforcement object based on a host boundary.
document:
The document.
hostElement:
The element that will host the AreaReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
majorDirection:
A vector to define the major direction of the AreaReinforcement.
areaReinforcementTypeId:
The id of the AreaReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
rebarHookTypeId:
The id of the RebarHookType.
If this parameter is InvalidElementId, it means to create a rebar with no hooks.
Returns:
The newly created AreaReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElement was not found in the given document.
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
areaReinforcementTypeId should refer to an AreaReinforcementType element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
rebarHookTypeId should be invalid or refer to an RebarHookType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2015

Autodesk.Revit.DB.Structure.AreaReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new AreaReinforcement object from an array of curves.
This method replaces the NewAreaReinforcement method, which has been deprecated.
document:
The document.
hostElement:
The element that will host the AreaReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
curveArray:
An array of curves that will define the outline of the AreaReinforcement.
majorDirection:
A vector to define the major direction of the AreaReinforcement.
areaReinforcementTypeId:
The id of the AreaReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
rebarHookTypeId:
The id of the RebarHookType.
If this parameter is InvalidElementId, it means to create a rebar with no hooks.
Returns:
The newly created AreaReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curveArray is empty.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The element hostElement was not found in the given document.
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
Curves in curveArray are not closed and continuous.
-or-
areaReinforcementTypeId should refer to an AreaReinforcementType element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
rebarHookTypeId should be invalid or refer to an RebarHookType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
majorDirection has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2015